Пансион83/src/Catalogs/ТипыСкидок/ТипыСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыСкидок</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>SortCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateValidFrom</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateValidTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AskForConfirmation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ConfirmationPattern</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>RoundPrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RoundPriceDigits</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RoundPriceType</name>
    <type>
      <types>EnumRef.DiscountAmountRoundTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DifferentDiscountPercentsForServiceGroupsAllowed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsAmountDiscount</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsManualDiscount</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsPersonalDiscount</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsAccumulatingDiscount</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HasToBeDirectlyAssigned</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsPerVisit</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsPerPeriod</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsForRackRatesOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccumulatingDiscountType</name>
    <type>
      <types>EnumRef.AccumulatingDiscountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalAlgorithm</name>
    <type>
      <types>CatalogRef.ВнешниеОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>AccumulatingDiscountDimension</name>
    <type>
      <types>EnumRef.AccumulatingDiscountDimensions</types>
    </type>
  </attributes>
  <attributes>
    <name>AccumulatingDiscountPeriod</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AccumulatingDiscountFromDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TurnOffAutomaticDiscounts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoNotApplyToExternalInterfaces</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EachNDayIsFreeOfCharge</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BonusCalculationFactor</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Пансион83/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>DiscountType</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Пансион83/src/InformationRegisters/НакопительныеСкидки/НакопительныеСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НакопительныеСкидки</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>DiscountType</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ResourceLimit</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Пансион83/src/AccumulationRegisters/НакопитСкидки/НакопитСкидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НакопитСкидки</name>
  <resources>
    <name>Ресурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Бонус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипСкидки</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИзмерениеСкидки</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
      <types>CatalogRef.Договора</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаГостей</name>
    <type>
      <types>CatalogRef.ГруппыГостей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Пансион83/src/Enums/AccumulatingDiscountTypes/AccumulatingDiscountTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AccumulatingDiscountTypes</name>
  <enumValues>
    <name>ByAccommodationDuration</name>
  </enumValues>
  <enumValues>
    <name>ByServicesTotalSum</name>
  </enumValues>
  <enumValues>
    <name>ByNumberOfGuestVisits</name>
  </enumValues>
  <enumValues>
    <name>ByServiceQuantity</name>
  </enumValues>
  <enumValues>
    <name>External</name>
  </enumValues>
</mdclass:Enum>

Пансион83/src/Catalogs/ТипыСкидок/ObjectModule.bsl
//-----------------------------------------------------------------------------
// Gets discount percent
// - pDate is optional. If is not specified, then function gets discount on current time
// Returns discount percent
//-----------------------------------------------------------------------------
Function pmGetDiscount(Val pDate = Неопределено, pService = Неопределено, pHotel = Неопределено) Экспорт
	// Fill parameter default values 
	If НЕ ЗначениеЗаполнено(pDate) Тогда
		pDate = CurrentDate();
	EndIf;
	vHotel = Справочники.Гостиницы.EmptyRef();
	If НЕ ЗначениеЗаполнено(pHotel) Тогда
		vHotel = ПараметрыСеанса.ТекущаяГостиница;
	Else
		vHotel = pHotel;
	EndIf;
	
	// Initialize return parameters
	vDiscount = 0;
	
	// Build query
	q = New Query;
	If ЗначениеЗаполнено(pService) Тогда
		q.Text =
		"SELECT
		|	Скидки.Скидка
		|FROM
		|	InformationRegister.Скидки.SliceLast(
		|			&qDate,
		|			ТипСкидки = &qDiscountType
		|				AND (Гостиница = &qHotel
		|					OR Гостиница = &qEmptyHotel)
		|				AND ServiceGroup IN (&qServiceGroupsList)) AS Скидки";
		// Set parameters
		q.SetParameter("qDate", pDate);
		q.SetParameter("qDiscountType", Ref);
		q.SetParameter("qHotel", vHotel);
		q.SetParameter("qEmptyHotel", Справочники.Гостиницы.EmptyRef());
		
		// Run query
		vResTable = q.Execute().Unload();
		For Each vResTableRow In vResTable Do
			vDiscount = vResTableRow.Discount;
			Break;
		EndDo;
	EndIf;
	If НЕ ЗначениеЗаполнено(pService) Or (ЗначениеЗаполнено(pService) And vDiscount = 0) Тогда
		q.Text =
		"SELECT
		|	Скидки.Скидка
		|FROM
		|	InformationRegister.Скидки.SliceLast(
		|			&qDate,
		|			ТипСкидки = &qDiscountType
		|				AND (Гостиница = &qHotel
		|					OR Гостиница = &qEmptyHotel)
		|				AND ServiceGroup = &qEmptyServiceGroup) AS Скидки";
		// Set parameters
		q.SetParameter("qDate", pDate);
		q.SetParameter("qDiscountType", Ref);
		q.SetParameter("qHotel", vHotel);
		q.SetParameter("qEmptyHotel", Справочники.Гостиницы.EmptyRef());
		q.SetParameter("qEmptyServiceGroup", Справочники.НаборыУслуг.EmptyRef());
		// Run query
		vResTable = q.Execute().Unload();
		For Each vResTableRow In vResTable Do
			vDiscount = vResTableRow.Discount;
			Break;
		EndDo;
	EndIf;
	If НЕ ЗначениеЗаполнено(pService) And vDiscount = 0 And НЕ DifferentDiscountPercentsForServiceGroupsAllowed Тогда
		q.Text =
		"SELECT
		|	Скидки.Скидка
		|FROM
		|	InformationRegister.Скидки.SliceLast(
		|			&qDate,
		|			ТипСкидки = &qDiscountType
		|				AND (Гостиница = &qHotel
		|					OR Гостиница = &qEmptyHotel)) AS Скидки";
		// Set parameters
		q.SetParameter("qDate", pDate);
		q.SetParameter("qHotel", vHotel);
		q.SetParameter("qEmptyHotel", Справочники.Гостиницы.EmptyRef());
		q.SetParameter("qDiscountType", Ref);
		// Run query
		vResTable = q.Execute().Unload();
		For Each vResTableRow In vResTable Do
			vDiscount = vResTableRow.Discount;
			Break;
		EndDo;
	EndIf;
	
	// Return
	Return vDiscount;
EndFunction //pmGetDiscount

//-----------------------------------------------------------------------------
// Gets accumulating discount percent
// - pDate is optional. If is not specified, then function gets discount on current time
// - pResource is mandatory. Resource is numeric value that is checked against resource limits.
// Returns discount percent
//-----------------------------------------------------------------------------
Function pmGetAccumulatingDiscount(pService, Val pDate = Неопределено, pResource, 
                                   rDiscountConfirmationText) Экспорт
	// Fill parameter default values 
	If НЕ ЗначениеЗаполнено(pDate) Тогда
		pDate = CurrentDate();
	EndIf;
	
	// Initialize return parameters
	vDiscount = 0;
	
	// Build query
	q = New Query;
	q.Text =
	"SELECT
	|	Скидки.Скидка,
	|	Скидки.ResourceLimit AS ResourceLimit,
	|	Скидки.ServiceGroup
	|FROM
	|	InformationRegister.НакопительныеСкидки.SliceLast(&qDate, ТипСкидки = &qDiscountType) AS Скидки
	|ORDER BY
	|	ResourceLimit";
	// Set parameters
	q.SetParameter("qDate", pDate);
	q.SetParameter("qDiscountType", Ref);
	// Run query
	vAccDiscounts = q.Execute().Unload();
	For Each vAccDiscount In vAccDiscounts Do
		If НЕ ЗначениеЗаполнено(vAccDiscount.ServiceGroup) Тогда
			
		EndIf;
		If vAccDiscount.ResourceLimit <= pResource Тогда
			vDiscount = vAccDiscount.Discount;
			rDiscountConfirmationText = СокрЛП(Description) + 
			                            " (" + pResource + " >= " + vAccDiscount.ResourceLimit + ")";
		Else
			Break;
		EndIf;
	EndDo;
	
	// Return
	Return vDiscount;
EndFunction //pmGetAccumulatingDiscount

//-----------------------------------------------------------------------------
Function pmGetAccumulatingDiscountResources(Val pDate = Неопределено, 
											pCustomer = Неопределено, 
                                            pContract = Неопределено, 
                                            pClient = Неопределено, 
                                            pDiscountCard = Неопределено,
											pGuestGroup = Неопределено) Экспорт
	// Fill parameter default values 
	If НЕ ЗначениеЗаполнено(pDate) Тогда
		pDate = CurrentDate();
	EndIf;
	// Initialize map with resources
	
	// Build and run query
	vDateTo = pDate;
	qAccDisRes = New Query;
	If AccumulatingDiscountPeriod = 0 And НЕ ЗначениеЗаполнено(AccumulatingDiscountFromDate) Тогда
		qAccDisRes.Text = 
		"SELECT
		|	AccumulatingDiscountResourcesBalances.ТипСкидки,
		|	AccumulatingDiscountResourcesBalances.ИзмерениеСкидки,
		|	AccumulatingDiscountResourcesBalances.ResourceClosingBalance AS Ресурс,
		|	AccumulatingDiscountResourcesBalances.BonusClosingBalance AS Бонус,
		|	AccumulatingDiscountResourcesBalances.BonusReceipt AS BonusReceipt
		|FROM
		|	AccumulationRegister.НакопитСкидки.BalanceAndTurnovers(
		|			,
		|			&qDateTo,
		|			Period,
		|			RegisterRecordsAndPeriodBoundaries,
		|			ТипСкидки = &qDiscountType
		|				AND (ИзмерениеСкидки = &qCustomer
		|						AND &qCustomerIsFilled
		|					OR ИзмерениеСкидки = &qContract
		|						AND &qContractIsFilled
		|					OR ИзмерениеСкидки = &qClient
		|						AND &qClientIsFilled
		|					OR ИзмерениеСкидки = &qDiscountCard
		|						AND &qDiscountCardIsFilled)
		|				AND (ГруппаГостей = &qGuestGroup
		|					OR &qGuestGroupIsEmpty)) AS AccumulatingDiscountResourcesBalances";
	Else
		qAccDisRes.Text = 
		"SELECT
		|	AccumulatingDiscountResourcesTurnovers.ТипСкидки,
		|	AccumulatingDiscountResourcesTurnovers.ИзмерениеСкидки,
		|	AccumulatingDiscountResourcesTurnovers.ResourceTurnover AS Ресурс,
		|	AccumulatingDiscountResourcesTurnovers.BonusTurnover AS Бонус,
		|	AccumulatingDiscountResourcesTurnovers.BonusReceipt AS BonusReceipt
		|FROM
		|	AccumulationRegister.НакопитСкидки.Turnovers(
		|			&qDateFrom,
		|			&qDateTo,
		|			Period,
		|			ТипСкидки = &qDiscountType
		|				AND (ИзмерениеСкидки = &qCustomer
		|						AND &qCustomerIsFilled
		|					OR ИзмерениеСкидки = &qContract
		|						AND &qContractIsFilled
		|					OR ИзмерениеСкидки = &qClient
		|						AND &qClientIsFilled
		|					OR ИзмерениеСкидки = &qDiscountCard
		|						AND &qDiscountCardIsFilled)
		|				AND (ГруппаГостей = &qGuestGroup
		|					OR &qGuestGroupIsEmpty)) AS AccumulatingDiscountResourcesTurnovers";
		If ЗначениеЗаполнено(AccumulatingDiscountFromDate) Тогда
			vDateFrom = BegOfDay(AccumulatingDiscountFromDate);
		Else
			vDateFrom = BegOfDay(vDateTo - AccumulatingDiscountPeriod*24*3600);
		Endif;
		qAccDisRes.SetParameter("qDateFrom", vDateFrom);
	EndIf;
	qAccDisRes.SetParameter("qDateTo", New Boundary(vDateTo, BoundaryType.Excluding));
	qAccDisRes.SetParameter("qDiscountType", Ref);
	qAccDisRes.SetParameter("qCustomer", pCustomer);
	qAccDisRes.SetParameter("qCustomerIsFilled", ЗначениеЗаполнено(pCustomer));
	qAccDisRes.SetParameter("qContract", pContract);
	qAccDisRes.SetParameter("qContractIsFilled", ЗначениеЗаполнено(pContract));
	qAccDisRes.SetParameter("qClient", pClient);
	qAccDisRes.SetParameter("qClientIsFilled", ЗначениеЗаполнено(pClient));
	qAccDisRes.SetParameter("qDiscountCard", pDiscountCard);
	qAccDisRes.SetParameter("qDiscountCardIsFilled", ЗначениеЗаполнено(pDiscountCard));
	qAccDisRes.SetParameter("qGuestGroup", pGuestGroup);
	qAccDisRes.SetParameter("qGuestGroupIsEmpty", НЕ ЗначениеЗаполнено(pGuestGroup));
	vAccDisRes = qAccDisRes.Execute().Unload();
	// Return
	Return vAccDisRes;
EndFunction //pmGetAccumulatingDiscountResources

//-----------------------------------------------------------------------------
// Calculates default accumulating discount dimension based
// Returns discount dimension
//-----------------------------------------------------------------------------
Function pmGetDefaultAccumulatingDiscountDimension() Экспорт
	vDiscountDimension = Неопределено;
	If ЗначениеЗаполнено(AccumulatingDiscountDimension) Тогда
		If AccumulatingDiscountDimension = Перечисления.AccumulatingDiscountDimensions.Клиент Тогда
			vDiscountDimension = Справочники.Клиенты.EmptyRef();
		ElsIf AccumulatingDiscountDimension = Перечисления.AccumulatingDiscountDimensions.Контрагент Тогда
			vDiscountDimension = Справочники.Контрагенты.EmptyRef();
		ElsIf AccumulatingDiscountDimension = Перечисления.AccumulatingDiscountDimensions.Договор Тогда
			vDiscountDimension = Справочники.Договора.EmptyRef();
		ElsIf AccumulatingDiscountDimension = Перечисления.AccumulatingDiscountDimensions.Агент Тогда
			vDiscountDimension = Справочники.Контрагенты.EmptyRef();
		ElsIf AccumulatingDiscountDimension = Перечисления.AccumulatingDiscountDimensions.ДисконтКарт Тогда
			vDiscountDimension = Справочники.ДисконтныеКарты.EmptyRef();
		EndIf;
	EndIf;
	Return vDiscountDimension;
EndFunction //pmGetDefaultAccumulatingDiscountDimension

//-----------------------------------------------------------------------------
// Calculates accumulating discount resource value based on given service and document
// pSrvRec - could be any charge document or services table part record
// Returns resource value for given service.
//-----------------------------------------------------------------------------
Function pmCalculateResource(pSrvRec, pNumberOfPersons, pFolio, pDiscountCard = Неопределено, rDiscountDimension = Неопределено, pIsResourceReservation = False) Экспорт
	vRes = 0;
	rDiscountDimension = Неопределено;
	vFolio = pFolio;
	vNumberOfPersons = ?(pNumberOfPersons > 0, pNumberOfPersons, 1);
	If ЗначениеЗаполнено(AccumulatingDiscountDimension) Тогда
		If AccumulatingDiscountDimension = Перечисления.AccumulatingDiscountDimensions.Клиент Тогда
			If ЗначениеЗаполнено(vFolio.Клиент) Тогда
				rDiscountDimension = vFolio.Клиент;
			Else
				rDiscountDimension = Справочники.Клиенты.EmptyRef();
			EndIf;
		ElsIf AccumulatingDiscountDimension = Перечисления.AccumulatingDiscountDimensions.Контрагент Тогда
			If НЕ ЗначениеЗаполнено(vFolio.Контрагент) Тогда
				Return 0;
			Else
				rDiscountDimension = vFolio.Контрагент;
			EndIf;
		ElsIf AccumulatingDiscountDimension = Перечисления.AccumulatingDiscountDimensions.Договор Тогда
			If НЕ ЗначениеЗаполнено(vFolio.Договор) Тогда
				Return 0;
			Else
				rDiscountDimension = vFolio.Договор;
			EndIf;
		ElsIf AccumulatingDiscountDimension = Перечисления.AccumulatingDiscountDimensions.Агент Тогда
			If НЕ ЗначениеЗаполнено(vFolio.Агент) Тогда
				Return 0;
			Else
				rDiscountDimension = vFolio.Агент;
			EndIf;
		ElsIf AccumulatingDiscountDimension = Перечисления.AccumulatingDiscountDimensions.ДисконтКарт Тогда
			If НЕ ЗначениеЗаполнено(pDiscountCard) Тогда
				Return 0;
			Else
				rDiscountDimension = pDiscountCard;
			EndIf;
		EndIf;
	Else
		Return 0;
	EndIf;
	If AccumulatingDiscountType = Перечисления.AccumulatingDiscountTypes.ByAccommodationDuration Тогда
		If НЕ pIsResourceReservation Тогда
			If pSrvRec.IsRoomRevenue Тогда
				If pSrvRec.ПроданоНомеров <> 0 Or pSrvRec.ПроданоМест <> 0 Тогда
					vRes = pSrvRec.ЧеловекаДни/vNumberOfPersons;
				EndIf;
			EndIf;
		EndIf;
	ElsIf AccumulatingDiscountType = Перечисления.AccumulatingDiscountTypes.ByNumberOfGuestVisits Тогда
		If НЕ pIsResourceReservation Тогда
			If pSrvRec.IsRoomRevenue Тогда
				If pSrvRec.ПроданоНомеров <> 0 Or pSrvRec.ПроданоМест <> 0 Тогда
					vRes = pSrvRec.ЗаездГостей/vNumberOfPersons;
				EndIf;
			EndIf;
		EndIf;
	ElsIf AccumulatingDiscountType = Перечисления.AccumulatingDiscountTypes.ByServicesTotalSum Тогда
		vRes = pSrvRec.Сумма - pSrvRec.СуммаСкидки;
	ElsIf AccumulatingDiscountType = Перечисления.AccumulatingDiscountTypes.ByServiceQuantity Тогда
		vRes = pSrvRec.Количество;
	ElsIf AccumulatingDiscountType = Перечисления.AccumulatingDiscountTypes.External Тогда
		Execute(TrimR(ExternalAlgorithm.Algorithm));
	EndIf;
	Return vRes;
EndFunction //pmCalculateResource

//-----------------------------------------------------------------------------
Процедура pmFillAttributesWithDefaultValues() Экспорт
	DateValidFrom = '00010101';
КонецПроцедуры //pmFillAttributesWithDefaultValues
